README.org
;; -*- coding: utf-8
#+OPTIONS: ^:{}
#+TITLE: Suk's Emacs Config

This is an Emacs distribution designed to enhance the default Emacs experience.
It modifies many default settings and bundles a large number of additional
packages and adds its own core library into the mix. The final product provides
Emacs newbies with an easy-to-use configuration, and provides a wealth of
additional capabilities for power users of Emacs.

Run the Org Babel Tangle command: `M-x org-babel-tangle` to generate the el
file.

* early-init.el
Some code that needs to be executed in advance.
#+begin_src emacs-lisp :tangle early-init.el
    ;; Defer garbage collection further back in the startup process
    (setq gc-cons-threshold most-positive-fixnum gc-cons-percentage 0.6)

    ;; Prevent unwanted runtime compilation for gccemacs (native-comp) users;
    ;; packages are compiled ahead-of-time when they are installed and site files
    ;; are compiled when gccemacs is installed.
    (setq native-comp-deferred-compilation nil ;; obsolete since 29.1
          native-comp-jit-compilation nil)


    ;; In Emacs 27+, package initialization occurs before `user-init-file' is
    ;; loaded, but after `early-init-file'. Doom handles package initialization, so
    ;; we must prevent Emacs from doing it early!
    (setq package-enable-at-startup nil)
    ;; Do not allow loading from the package cache (same reason).
    (setq package-quickstart nil)
    ;; `use-package' is builtin since 29.
    ;; It must be set before loading `use-package'.
    (setq use-package-enable-imenu-support t)


    ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
    (push '(menu-bar-lines . 0) default-frame-alist)
    (push '(tool-bar-lines . 0) default-frame-alist)
    (push '(vertical-scroll-bars) default-frame-alist)
    (when (featurep 'ns)
      (push '(ns-transparent-titlebar . t) default-frame-alist))
    (setq-default mode-line-format nil)
    ;;(global-unset-key (kbd "C-SPC"))

#+end_src

* init.el
The configuration entrance is mainly used to load other settings and plug-ins.

** Define some startup directories to facilitate next migration and modification
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;;; init.el --- Initialize configurations.  -*- lexical-binding: t -*-
  ;; Copyright (C) 1999 - 2024 Suk
  ;; Author: Suk

  ;; This file is not part of GNU Emacs.
  ;;

  ;; This program is free software; you can redistribute it and/or
  ;; modify it under the terms of the GNU General Public License as
  ;; published by the Free Software Foundation; either version 2, or
  ;; (at your option) any later version.
  ;;
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  ;; General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program; see the file COPYING.  If not, write to
  ;; the Free Software Foundation, Inc., 51 Franklin Street, Fifth
  ;; Floor, Boston, MA 02110-1301, USA.
  ;;
  ;;; Commentary
  ;;
  ;; Emacs configurations.
  ;;

  ;;; Code:


  (when (version< emacs-version "27.1")
    (error "This requires Emacs 27.1 and above!"))

  ;; 定义一些启动目录，方便下次迁移修改
  (defvar suk-emacs-root-dir (file-truename user-emacs-directory))
  (defvar suk-emacs-config-dir (expand-file-name "etc" suk-emacs-root-dir))
  (defvar suk-emacs-extension-dir (expand-file-name "extensions" suk-emacs-root-dir))
  (defvar suk-emacs-share-dir (expand-file-name "share" suk-emacs-root-dir))
  (defvar suk-emacs-themes-dir (expand-file-name "themes" suk-emacs-share-dir))
  (defvar suk-emacs-elpa-dir (expand-file-name "elpa" suk-emacs-root-dir))
  (defvar suk-emacs-var-dir (expand-file-name "var" suk-emacs-root-dir))
  (defvar suk-emacs-tmp-dir (expand-file-name "tmp" suk-emacs-var-dir))
  (defvar suk-emacs-backup-dir (expand-file-name "backup" suk-emacs-tmp-dir))


  (defvar user-home-dir (getenv "HOME"))

  (if (eq system-type 'windows-nt)
      (defvar user-home-dir (getenv "USERPROFILE")))
#+END_SRC

** Set the path to some temporary files and folders
#+BEGIN_SRC emacs-lisp :tangle init.el
      ;; 设置缓存文件/杂七杂八的文件存放的地址
      ;; 不好的做法

      ;; (setq user-emacs-directory "~/.emacs.d/var")

      ;; blink search
      (setq blink-search-db-path (expand-file-name "blink-search.db" suk-emacs-tmp-dir))
      ;; Saveplace
      (setq save-place-file (concat suk-emacs-var-dir "/saveplace"))
      ;; Recentf
      (setq recentf-save-file (concat suk-emacs-var-dir "/recentf"))
      ;;(setq recentf-save-file "~/.emacs.d/var/recentf")
      ;; History
      (setq savehist-file (concat suk-emacs-var-dir "/history"))
      ; Amx
      (setq amx-save-file (concat suk-emacs-var-dir "/amx-items"))
      ;; Auto save
      (setq auto-save-list-file-prefix (concat suk-emacs-var-dir "/auto-save-list/.saves-"))
      ;; Eshell
      (setq eshell-directory-name (concat suk-emacs-var-dir "eschell"))
      (setq eshell-history-file-name (concat eshell-directory-name "/history"))
      ;; projectitle-bookmarks
      (setq projectile-known-projects-file (concat suk-emacs-var-dir "/projectile-bookmarks.eld"))
      (setq backup-directory-alist `(("" . ,suk-emacs-tmp-dir)))
      ;; Bookmark
      (setq bookmark-default-file (concat suk-emacs-var-dir "/emacs.bmk"))
      ;; Diary
      (setq diary-file (concat user-home-dir "/diary"))

#+END_SRC

** A function: recursively loads emacs settings and plug-in files
#+BEGIN_SRC emacs-lisp :tangle init.el
     ;; Ignore `cl` expiration warnings
     (setq byte-compile-warnings '(cl-function))

     ;; original version
     ;;(defun add-subdirs-to-load-path (dir)
     ;;  "Recursive add directories to `load-path'."
     ;;  (let ((default-directory (file-name-as-directory dir)))
     ;;     (add-to-list 'load-path dir)
     ;;     (normal-top-level-add-subdirs-to-load-path)))

     ;; 王勇的版本 https://manateelazycat.github.io/emacs/2022/03/02/emacs-load-directory-recursively.html
     (require 'cl-lib)
     (defun add-subdirs-to-load-path (search-dir isFirst)
       (interactive)
       (when isFirst
         ;; 原来的版本没有把第1个 search-dir 本身添加到load path
         ;; 递归时的search-dir是在递归前加入了。
         (add-to-list 'load-path search-dir))
       (let* ((dir (file-name-as-directory search-dir)))
         (dolist (subdir
                  ;; 过滤出不必要的目录，提升Emacs启动速度
                  (cl-remove-if
                   #'(lambda (subdir)
                       (or
                        ;; 不是文件的都移除
                        (not (file-directory-p (concat dir subdir)))
                        ;; 目录匹配下面规则的都移除
                        (member subdir '("." ".." ;Linux当前目录和父目录
                                         "dist" "node_modules" "__pycache__" ;语言相关的模块目录
                                         "RCS" "CVS" "rcs" "cvs" ".git" ".github")))) ;版本控制目录
                   (directory-files dir)))
           (let ((subdir-path (concat dir (file-name-as-directory subdir))))
             ;; 目录下有 .el .so .dll 文件的路径才添加到 load-path 中，提升Emacs启动速度
             (when (cl-some #'(lambda (subdir-file)
                                (and (file-regular-p (concat subdir-path subdir-file))
                                     ;; .so .dll 文件指非Elisp语言编写的Emacs动态库
                                     (member (file-name-extension subdir-file) '("el" "so" "dll"))))
                            (directory-files subdir-path))

               ;; 注意：add-to-list 函数的第三个参数必须为 t ，表示加到列表末尾
               ;; 这样Emacs会从父目录到子目录的顺序搜索Elisp插件，顺序反过来会导致Emacs无法正常启动
               (add-to-list 'load-path subdir-path t))

             ;; 继续递归搜索子目录
             (add-subdirs-to-load-path subdir-path nil)))))

     ;; 加载指定的目录
     (add-subdirs-to-load-path suk-emacs-config-dir t)
     (add-subdirs-to-load-path suk-emacs-extension-dir t)
     (add-subdirs-to-load-path suk-emacs-themes-dir t)
     (add-subdirs-to-load-path suk-emacs-elpa-dir t)

#+END_SRC

