README.org
** Recursively load files, load emacs settings and plug-ins
#+BEGIN_SRC emacs-lisp :tangle init.el
  ;; The contents of the Emacs configuration file are written below.

  (let
      (
       ;;  Temporarily increase `gc-cons-threshold' when loading to speed up
       ;;  startup.
       (gc-cons-threshold most-positive-fixnum)
       (gc-cons-percentage 0.8)

       ;; Clear to avoid analyzing files when loading remote files.
       (file-name-handler-alist nil))
    ;; Don't pass case-insensitive to `auto-mode-alist'
    (setq auto-mode-case-fold nil)
    ;; Prevent flashing of unstyled modeline at startup
    (setq-default mode-line-format nil)
    (unless (or (daemonp) noninteractive init-file-debug)
      ;; Suppress file handlers operations at startup
      ;; `file-name-handler-alist' is consulted on each call to `require' and `load'
      (let ((old-value file-name-handler-alist))
        (setq file-name-handler-alist nil)
        (set-default-toplevel-value 'file-name-handler-alist file-name-handler-alist)
        (add-hook 'emacs-startup-hook
                  (lambda ()
                    "Recover file name handlers."
                    (setq file-name-handler-alist
                          (delete-dups (append file-name-handler-alist old-value))))
                  101)))

    ;; Emacs配置文件内容写到下面.
    (add-hook 'emacs-startup-hook
              (lambda ()
                "Restore defalut values after init."
                (setq file-name-handler-alist default-file-name-handler-alist)
                ;; The default is 0.8MB
                ;;(setq gc-cons-threshold 80000000)
                (message "Emacs ready in %s with %d garbage collections."
                         (format "%.2f seconds"
                                 (float-time
                                  (time-subtract after-init-time before-init-time)))
                         gcs-done)
                (add-hook 'focus-out-hook 'garbage-collect)))


    (with-temp-message ""     ;Erase the output of plug-in startup
      ;; Constants
      (require '+const)

      ;; Customization
      (require '+custom)
      ;; Packages
      (require 'init-basic)
      (require 'init-awsome-pair)
      (require 'lazy-load)
      (require 'init-key)
      (require 'init-package)
      (require 'init-completion)
      (require 'init-ui)
      (require 'init-org)
      (require 'init-utils)
      (require 'init-mode)
      (when sys/linuxp
        (progn
          (require 'init-shell)
          (require 'init-im)   ;; windows 下表现不好
          (require 'init-sudo)
          )
        )
      ;; Restore session at last.
      (require 'init-session)
      (emacs-session-restore)
      (server-start)
      ;; delay load
      (run-with-idle-timer
       1 nil
       #'(lambda ()
           (require 'init-bookmark)
           (require 'init-buffers)
           (require 'init-recentf)
           (require 'init-dired)

           (require 'init-auto-save)
           (require 'init-edit)
           (require 'init-idle)
           (require 'init-eshell)
           ;;(require 'highlight-parentheses)
           (require 'init-highlight)
           (require 'init-window)
           (require 'init-markdown)
           (require 'init-reader)

           (require 'init-calendar)
           (require 'load-abbrev)
           (require 'init-ext-packages)
           ;; Programming
           (require 'init-ide)
           ;; Make gc pauses faster by decreasing the threshold.
           (setq gc-cons-threshold (* 16 1000 1000))

           ))
      )
    )


#+END_SRC
* etc/+const.el
Define some system flag.
#+begin_src  emacs-lisp :tangle etc/+const.el
  ;; +const.el --- Define constants.	-*- lexical-binding: t -*-

  ;; Copyright (C) 1999 - 2024 Suk

  ;; Author: Suk

  ;; This file is not part of GNU Emacs.
  ;;
  ;; This program is free software; you can redistribute it and/or
  ;; modify it under the terms of the GNU General Public License as
  ;; published by the Free Software Foundation; either version 2, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  ;; General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program; see the file COPYING.  If not, write to
  ;; the Free Software Foundation, Inc., 51 Franklin Street, Fifth
  ;; Floor, Boston, MA 02110-1301, USA.
  ;;

  ;;; Commentary:
  ;;
  ;; Define constants.
  ;;

  ;;; Code:
  (defconst custom-template-file
    (expand-file-name "custom-template.el" user-emacs-directory)
    "Custom template file of Suk's Emacs.")

  (defconst suk-homepage
    "https://github.com/bruceasu/.emacs.d"
    "The Github page of this Emacs config.")

  (defconst sys/win32p
    (eq system-type 'windows-nt)
    "Are we running on a WinTel system?")

  (defconst sys/linuxp
    (eq system-type 'gnu/linux)
    "Are we running on a GNU/Linux system?")

  (defconst sys/macp
    (eq system-type 'darwin)
    "Are we running on a Mac system?")

  (defconst sys/mac-x-p
    (and (display-graphic-p) sys/macp)
    "Are we running under X on a Mac system?")

  (defconst sys/linux-x-p
    (and (display-graphic-p) sys/linuxp)
    "Are we running under X on a GNU/Linux system?")

  (defconst sys/cygwinp
    (eq system-type 'cygwin)
    "Are we running on a Cygwin system?")

  (defconst sys/rootp
    (string-equal "root" (getenv "USER"))
    "Are you using ROOT user?")

  (defconst emacs/>=25p
    (>= emacs-major-version 25)
    "Emacs is 25 or above.")

  (defconst emacs/>=26p
    (>= emacs-major-version 26)
    "Emacs is 26 or above.")

  (defconst emacs/>=27p
    (>= emacs-major-version 27)
    "Emacs is 27 or above.")

  (defconst emacs/>=28p
    (>= emacs-major-version 28)
    "Emacs is 28 or above.")

  (defconst emacs/>=29p
    (>= emacs-major-version 29)
    "Emacs is 29 or above.")

  (defconst emacs/>=30p
    (>= emacs-major-version 30)
    "Emacs is 30 or above.")

  (provide '+const)

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; +const.el ends here

#+end_src
