init.el

;; The contents of the Emacs configuration file are written below.

(let
    (
     ;;  Temporarily increase `gc-cons-threshold' when loading to speed up
     ;;  startup.
     (gc-cons-threshold most-positive-fixnum)
     (gc-cons-percentage 0.8)

     ;; Clear to avoid analyzing files when loading remote files.
     (file-name-handler-alist nil))
  ;; Don't pass case-insensitive to `auto-mode-alist'
  (setq auto-mode-case-fold nil)
  ;; Prevent flashing of unstyled modeline at startup
  (setq-default mode-line-format nil)
  (unless (or (daemonp) noninteractive init-file-debug)
    ;; Suppress file handlers operations at startup
    ;; `file-name-handler-alist' is consulted on each call to `require' and `load'
    (let ((old-value file-name-handler-alist))
      (setq file-name-handler-alist nil)
      (set-default-toplevel-value 'file-name-handler-alist file-name-handler-alist)
      (add-hook 'emacs-startup-hook
                (lambda ()
                  "Recover file name handlers."
                  (setq file-name-handler-alist
                        (delete-dups (append file-name-handler-alist old-value))))
                101)))

  ;; Emacs配置文件内容写到下面.
  (add-hook 'emacs-startup-hook
            (lambda ()
              "Restore defalut values after init."
              (setq file-name-handler-alist default-file-name-handler-alist)
              ;; The default is 0.8MB
              ;;(setq gc-cons-threshold 80000000)
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)
              (add-hook 'focus-out-hook 'garbage-collect)))


  (with-temp-message ""     ;Erase the output of plug-in startup
    ;; Constants
    (require '+const)

    ;; Customization
    (require '+custom)
    ;; Packages
    (require 'init-basic)
    (require 'init-awsome-pair)
    (require 'lazy-load)
    (require 'init-key)
    (require 'init-package)
    (require 'init-completion)
    (require 'init-ui)
    (require 'init-org)
    (require 'init-utils)
    (require 'init-mode)
    (when sys/linuxp
      (progn
        (require 'init-shell)
        (require 'init-im)   ;; windows 下表现不好
        (require 'init-sudo)
        )
      )
    ;; Restore session at last.
    (require 'init-session)
    (emacs-session-restore)
    (server-start)
    ;; delay load
    (run-with-idle-timer
     1 nil
     #'(lambda ()
         (require 'init-bookmark)
         (require 'init-buffers)
         (require 'init-recentf)
         (require 'init-dired)

         (require 'init-auto-save)
         (require 'init-edit)
         (require 'init-idle)
         (require 'init-eshell)
         ;;(require 'highlight-parentheses)
         (require 'init-highlight)
         (require 'init-window)
         (require 'init-markdown)
         (require 'init-reader)

         (require 'init-calendar)
         (require 'load-abbrev)
         (require 'init-ext-packages)
         ;; Programming
         (require 'init-ide)
         ;; Make gc pauses faster by decreasing the threshold.
         (setq gc-cons-threshold (* 16 1000 1000))

         ))
    )
  )
